-- MySQL dump 10.13  Distrib 5.6.24, for Win32 (x86)
--
-- Host: 127.0.0.1    Database: storagedb
-- ------------------------------------------------------
-- Server version	5.6.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `storage`
--

DROP TABLE IF EXISTS `storage`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `storage` (
  `gushi` varchar(767) NOT NULL,
  PRIMARY KEY (`gushi`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `storage`
--

LOCK TABLES `storage` WRITE;
/*!40000 ALTER TABLE `storage` DISABLE KEYS */;
INSERT INTO `storage` VALUES ('Ãû×Ö£¬´Ó½øÈëÎÒÈËÉúµÄÄÇÒ»¿ÌÆð¾ÍÊÇÌìÊ¹£¬ÄãÒª¼Ç×¡'),('Ã»ÓÐÄÐÅóÓÑ£¬ÄÇÎÒÊÇÊ²Ã´'),('Ð»Ð»\r\nÔ­À´ÄãÕâÃ´¶®ÀñÃ²µÄ°¡£¬ÎÒÒ»¿ªÊ¼»¹ÒÔÎªÄãÊÇºÜËæ±ãµÄÅ®º¢ÄØ\r\nÎÒÔõÃ´Ëæ±ãÁË\r\nÎÒ¾ÍÏ²»¶Äã¸Õ²ÅµÄÑù×Ó£¬ºÃ¿É°®'),('Ð»Ð»£¬Ò»ÆðºÈÂð'),('ÊÇ²»ÊÇ×öÄãÅóÓÑ¾ÍµÃ±»ÄãÆÛ¸º°¡£¬ÄãÅóÓÑ¶¼ÔõÃ´ÈÌÊÜÄãµÄ£¿\r\nÎÒºÍÄã¿É²»ÊÇÅóÓÑ\r\nÅ¶£¬ÊÇÎÒ×Ô×÷¶àÇéÁË'),('Èç¹û³Ã¿´²»¼û¸É»µÊÂ£¬ÎÒ»á½ÐÅ¶'),('ÉÏ°àºÃÀÛ\r\nµ«ÊÇÏÖÔÚÄãºÜ¿ªÐÄ°¡\r\nÎªÊ²Ã´\r\nÒòÎª¿ÉÒÔºÍÄ³¸öÄÐÉúËµÉÏ°àºÃÀÛ'),('ÏëÇ£ÄãµÄÊÖ£¬ÏëÓµ±§Äã£¬ÈÌµÄºÜÐÁ¿àÁË'),('ÏëÌýÕæ»°£¿Óö¼ûÄãÊÇÎÒÕâ±²×Ó×îÐÒ¸£µÄÊÂ£¬ÎÒÔõÃ´»áÈÃÐÒ¸£´ÓÎÒµÄÉí±ßÍµÍµÁï×ßÄØ'),('ÎÒÊÇ²»ÊÇ¸»¶þ´ú£¬¿´×ÅËý£¬ºÍÄãÓÐÊ²Ã´¹ØÏµ£¬»ØÍ·£¬Äã¶ÔÎÒÍ¦ºÃÆæµÄÂï'),('ÎÒÍË³ö¿É²»ÊÇÎªÁËÈÃÄãºÍÄÇÑùµÄÈË½»Íù'),('ÎÒÏëºÍÄãÑÝÄÇ¸ö½ÇÉ«\r\nÊÇÏëÑÝÄÇ¸ö½ÇÉ«»¹ÊÇÏëÎÒ'),('ÎÒÄÇ¸öÊ±ºòÆ¯ÁÁ¼«ÁË\r\nÎÒºÃÏëºÍÄÇ¸öÆ¯ÁÁµÄËýÔ¼»á°¡£¬¿´À´Ëý½ñÌì²»ÔÚ°¡'),('ÎÒ°®Äã\r\nÊÕµ½'),('ÎÒ³¤ÕâÃ´´óÏÖÔÚ×î¿ªÐÄ£¬ºÍÃÀÅ®Ò»Æð£¬×ö×î¼¤¶¯µÄÊÂ\r\nÎÒ²»ÊÇÃÀÅ®\r\nÅ¶£¬µÆ¹âÌ«´ÌÑÛ£¬Ã»¿´Çå'),('ÎÒµÄÑªÐÍ£¬ÊÇ±»ÄãÐûÅÐµÄÎÞÆÚÍ½ÐÌ'),('ÎÒ¸ÕÒªµÀÇ¸ÄØ£¬¾Íµ±Ò»ÆðËµ¹ýÁË°É'),('Î¶È«ÊÇÎÒºÈ¹ýµÄ×îÄÑºÈµÄÒûÁÏ\r\nÎÒÉÏ´óÑ§µÄÊ±ºò£¬ÌåÓý¿ÎÏÂ¿Î£¬ÀÏÊ¦ÈÃÎÒºÍÎÒÊÒÓÑ°ÑÆ÷²Ä°á»Ø½¡Éí·¿£¬»ØÀ´µÄÊ±ºò£¬Â·¹ýÐ¡Âô²¿£¬ÎÒ¿´µ½Î¶È«ÁË£¬µ±Ê±Î¶È«ÔÚÎÒÃÇÑ§Ð£×ö¹ýÒ»´ÎºÜ´óÐÍµÄ¹ã¸æ£¬ÎÒÏë³¢³¢¾ÍÂòÁËÒ»Æ¿£¬ºÈÁËÒ»¿ÚÎÒËµ£¬àÅ£¬ÕâÎ¶µÀ²»´í£¬Äã¿ÉÒÔÂòÒ»Æ¿£¬ÎÒÊÒÓÑºÜ¸ßÐËµÄ´Ó±ùÏäÀïÓÖÄÃÁËÒ»Æ¿£¬ÄÐÉúµÄÌåÓý¿ÎÂï£¬ÔË¶¯Á¿¶¼ºÜ´óµÄ£¬±È½Ï¿Ú¿Ê£¬ÎÒÊÒÓÑ¿ªÁË¸Ç×Ó¾Í´ó¿Ú´ó¿ÚµÄºÈÏÂÈ¥ÁË£¬È»ºóËûµÄÃæ²¿¼¡Èâ¾Í¿ªÊ¼±äµÃÅ¤ÇúÆðÀ´£¬¿´µ½ÎÒÔÚÅÔ±ßÐ¦µÄ¿ìÕ¾²»ÆðÀ´ÁË£¬ËûÖÕÓÚÒâÊ¶µ½ÁËÊ²Ã´¡£\r\nÖ±½Ó°ÑÆ¿×ÓÔÒÁË¹ýÀ´¡£\r\nÏñ±äÖÊµÄËáÄÌ¡£'),('Ì¸Áµ°®±¾À´¾ÍÊÇ£¬×Ô¼ºÄÜ×öµÄÊÂ£¬·ÇÒª¶Ô·½ÎªÄã×ö'),('ÕâÃ´Ð¡µÄ¸ÅÂÊ¶¼±»ÎÒ×öµ½ÁË'),('ÕâÊÇ¸øÎÒÂòµÄÂð\r\nÕâÊÇÎÒÖ®Ç°¸øÇ°Å®ÓÑÂòµÄ'),('ÒòÎªÔ¶£¬ËùÒÔ²ÅÄÜºÍÄã¶à´ôÒ»»á¶ù°¡'),('ÕûÌìºÍ´óÀÏÒ¯ÃÇÔÚÒ»Æð£¬ÍæÐ¦¿ª´óÁË'),('ÔÚÄãÏëÎÒÖ®Ç°£¬ÎÒ²»¾ÍÀ´ÁËÂð\r\nÎÒÖ¸µÄÊÇÏÖÔÚ°¡£¬±¿'),('ÔÙ¼ûµ½Äã£¬ÎÒºÜ¸ßÐË£¬²»ÒªÔÚÒ»¿ªÊ¼¼ûÃæµÄÊ±ºòËµ'),('Òª²»ÄãÈ¥ÎÒ¼Ò°É£¬²»ÐÐ£¬ÍíÉÏÎÒ»¹ÓÐÊÂ£¬ÏÂ´Î°É'),('Ô­À´Èç´Ë'),('Ò²¾ÍÊÇ¶ÔÄã²ÅÃ»ÄÇÃ´¶à±Ü»ä'),('Õ½ÓÑ¿É¿¿£¬ÐÄÀïÌ¤Êµ°¡'),('Å®Íõ´óÈË\r\n°ÝÍÐËµ»°µÄÊ±ºò²»ÒªÅç¿ÚË®'),('ÄãÏ²»¶Ê²Ã´ÑùµÄÅ®Éú\r\nºÜÅ¬Á¦µ«Å¼¶û»áÍµÀÁÒ»ÏÂ£¬»áÊ§Âäµ«¾ø²»»á»ÒÐÄ£¬»áºúÂÒ³Ô´×µ«ÏàÐÅ¶Ô·½µÄÕæÐÄ£¬»áÒ»Ö±×·×ÅÎÒÎÊÕâ¸öÎÊÌâÎÒ²»»Ø´ð¾ö²»°ÕÐÝ'),('ÄãÌ¸Áµ°®ÁË°É\r\nÅ¶£¬ÕâÃ´¹ØÐÄÎÒ°¡'),('ÄãÕâÑùµÄÈË£¬ÊÇ²»ÊÇÓÐºÜ¶àÅ®ÉúÏ²»¶Äã\r\nÅ®ÉúÔõÃ´¶¼Ï²»¶ÎÊÕâÑùµÄÎÊÌâ\r\nËµÊÇ°É£¬²»¸ßÐË£¬Ëµ²»ÊÇ°É£¬ÓÖ²»¿ÏÐÅ'),('ÄãÓÐÇéÓÐÒå£¬£¬£¬Ò²ÓÐ³¤Ïà'),('Äã²»¿ÉÒÔÔ½¹ýÕâÌõÏßÅ¶\r\n²»¿ÉÒÔÔ½¹ýÄÄÌõÏß\r\n²»¿ÉÒÔÔ½¹ýÎÒµÄÊÓÏß'),('ÄãµÄÇéÐ÷ÔÚ¸ú×ÅÎÒµÄÇéÐ÷±ä»¯°¥£¬ÄãÒ»¶¨ÊÇ°®ÉÏÎÒÁË'),('ÄãµÄÕâ¼þÒÂ·þ£¬×ÜÄÜ³ÄÍÐÄãµÄÄ³ÖÖÆøÖÊ£¬µ«Ò»Ê±°ë»á¶ùÎÒÓÖÏë²»µ½ÄÇ¸ö´Ê'),('Äã¸ÉÂïÒ»Ö±¿´×ÅÎÒ\r\nÒòÎªÎÒµÄÅ®ÅóÓÑ½ñÌìºÜÆ¯ÁÁ°¡\r\n»òÕß\r\n²»Ëµ»°\r\nÄã½ñÌìÕæÆ¯ÁÁ'),('Äã¸Õ²Å³å×ÅÎÒº°Î¹°É\r\nÄã¶à´ó\r\nÎÒ»¹µ£ÐÄÄãÊÇÎ´³ÉÄêÉÙÅ®ÄØ'),('Äã»¹Ã»ÓÐ»Ø´ðÎÒµÄÎÊÌâÄØ£¬¹ýµÄºÃÂð'),('ÄÇÌìºÜ±§Ç¸£¬°ÑÄãÈÓÏÂ×ßÁË'),('ÄÇÄã×ß°É£¬²»ÒªÔÙ¼ûµ½ÎÒÁË'),('ÄÇ¼Ò»ïÕæµÄ²»Ïñ»°'),('Ä³ÈËÄÇÃ´¸ßÐËÊÇ²»ÊÇÓ¦¸ÃÐ¦³öÀ´'),('±ð¾õµÃ×Ô¼ºÐÄË¼±»¿´´©¾ÍÊäÁË£¬·´ÕýÊÇÎÒÏ²»¶Äã¸ü¶à'),('±ð¾õµÃ×Ô¼ºÐÄË¼±»¿´´©¾ÍÊäÁË£¬·´ÕýÎÒÏÖÔÚ±ÈÄã¸ü¿ªÐÄ'),('±ð×öÃÎÁË\r\nÎÒµÄÃÎÎÒ×öÖ÷'),('±»ÎÒÎÇÊÇ²»ÊÇºÜ¸ßÐËÄØ£¿\r\nÇéÐ÷¼¤¶¯\r\nÐ¦Ò»ÏÂ£¬×ªÒÆ»°Ìâ\r\nÏë¿Þ\r\n¶Ô²»Æð£¬Í£Ò»ÏÂ£¬¸Õ²ÅÃ»ÎÇºÃ£¬Òª²»ÎÒÔÙÎÇÒ»´Î£¿'),('²»ÒªÌ«Ä¤°ÝÎÒÅ¶'),('´òÉ¢ÁËÎÒÀíÐÔµÄ¸Ð¹Ù'),('µÈÈËµÄ¸Ð¾õ£¬»¹Í¦²»´í\r\n²»»Ø´ð£¬¿´µ½ÎÒ£¬Ò»ÏÂ½ôÕÅÁË£¿Ç£ÊÖ\r\nÄÇÈÃÄã¶àµÈÒ»»á¶ù£¬ÄÇÎÒ¿ÉÒª×ßÁË£¬»»³ÉÈÃÄã×·ÎÒ'),('·´ÕýÎÒ¶¼¿´µ½ÁË£¬µ«²»Ï²»¶ÈÃ±ðÈË¿´'),('¸ãÐ¦°É£¬ÎÒÓÖÃ»·¸Ê²Ã´ËÀ×ï£¬ËµÕâÖÖ»°µÄÄØÒ»°ã¶¼ÊÇÐ©´ÀÄÐÈË£¬ÎÒÄØ£¬»á×î´óÅ¬Á¦µÄÓÃÊÓÏßºÍÄã½»Á÷\r\nÄÇÄã½»Á÷°É\r\n¶¼ÊÇÎÒµÄ´í£¬ËýÒ»µã¶¼Ã»ÓÐ´í'),('¸Ã¸ÐÐ»µÄ»¹ÊÇÒª¸ÐÐ»'),('¸øÎÒÕª¸öÐÇÐÇÏÂÀ´\r\nÒÑ¾­ÕªÁË£¬×øÔÚÎÒÉíÅÔÄØ'),('ºÃÏë³öÈ¥Íæ\r\nºÃÏëºÍÄãÒ»Æð³öÈ¥Íæ\r\nÄÇÎÒ¾Í²»È¥ÁË\r\nÎÒ²»¹ýÊÇ°ÑÄ³ÈËµÄ»°·­ÒëÍêÕûÁË¶øÒÑ'),('ºÍ±ðµÄÄÐÈËÂð£¿½ÐÎÒºÍ±ðµÄÄÐÈËºÃºÃ¹ýÈÕ×ÓÂð'),('½ø¸ßÖÐµÄµÚ¶þ´ÎÓïÎÄ¿¼ÊÔ£¬¿¼Íê¾Í¸Ð¾õÕâ´ÎÒª²»¼°¸ñÁË£¬·¢¾íµÄÄÇÌì£¬ÀÏÊ¦Ò»½ø½ÌÊÒ¾ÍµÉÁËÎÒÒ»ÑÛ£¬ÎÒÒ»Ïë£¬ÍêÁË£¬Õâ´Î¿Ï¶¨²»¼°¸ñÁË£¬ËûÁ³É«Ò²ºÜÄÑ¿´£¬ËµÎÒÃÇÈ«°à¿¼µÄ¶¼ºÜ²î£¬ËûÒªÒ»ÕÅÒ»ÕÅ·¢ÊÔ¾í£¬È»ºóÎÒÃÇ¾ÍÕâÑù¿´×ÅËû±§×ÅÕâÃ´ºñµÄÒ»¶ÑÊÔ¾í£¬´ÓµÚÒ»×é×ßµ½µÚÈý×é£¬ÔÙ´ÓµÚÈý×é×ßµ½µÚÒ»×é£¬ÖÕÓÚÎÒ¿´µ½Ëû³¯ÎÒ×ß¹ýÀ´ÁË£¬ÎÒ¸Ðµ½Ò»¹ÉÇ¿´óµÄÉ±ÆøÆËÃæ¶øÀ´£¬Ëû°Ñ¾í×ÓÍùÎÒ×ÀÉÏÒ»ÈÓ£¬ÎÒÒ»¿´20·Ö£¬Ò»ÏÂ¾Í´ôµôÁË£¬ÎÒµ±Ê±¾Í¾õµÃÆæ¹ÖÁË£¬ÔÙ²îÒ²²»ÖÁÓÚ20·Ö°É£¬ÔÙ×ÐÏ¸Ò»¿´20·ÖÅÔ±ßÐ´µÄÊÇÎÒÍ¬×ÀµÄÃû×Ö£¬ÎÒµ±Ê±ºÃÇìÐÒ£¬»¹ºÃ²»ÊÇÎÒ£¬È»ºóÀÏÊ¦Ð¦ÁË£¬°ÑÎÒµÄ¾í×Ó´Óµ×ÏÂ³é³öÀ´£¬ÍùÎÒ×ÀÉÏÒ»ÅÄ£¬ÄØ£¬ÓïÎÄ¿Î´ú±í£¬59·Ö£¬Ö®ºóµÄÕûÌÃ¿ÎÀï¸÷ÖÖ·í´Ì£¬Ò»½²µ½´íÎóÂÊ¸ßµÄÌâÄ¿¾ÍËµ£¬¹Ø¼üÊÇÍ·´øµÄ²»´í£¬ÐÂÑ¡µÄÕâ¸öÓïÎÄ¿Î´ú±íÕæºÃ£¬ÎÒµ±Ê±¾ÍÕâÑùµÍ×ÅÍ·Ò»Ö±¿´×Å¾í×Ó£¬ºÞ²»µÃ°Ñ×Ô¼ºÈû³éÌëÀïÈ¥'),('¿´Äã³¤µÄÕâÃ´Æ¯ÁÁ£¬Ò»¶¨Ã»ÄÐÅóÓÑ\r\nÎªÊ²Ã´Æ¯ÁÁ·´¶øÃ»ÄÐÅóÓÑ£¿\r\nÆ¯ÁÁÊÇ¼ÓÒýºÅµÄÂï'),('¿´ÆðÀ´¸üË§ÁË£¬²»¹ý²»ÊÇºÜÃ÷ÏÔ'),('¿´×ÅËý£¬¸Õ²ÅµÄ±íÇéÃ÷Ã÷ÊÇºÜÏëÖªµÀµÄÑù×Ó'),('¿¼ÊÔ±¾Éí²»½ôÕÅ£¬×î½ôÕÅµÄ¾ÍÊÇ·¢¾í×ÓµÄÊ±ºò£¬ÓÈÆäÊÇ°àÀïÃ»¿¼ºÃµÄÊ±ºò£¬Õâ¸ö¹ý³Ì¾Í¸Ð¾õ·Ç³£Âý');
/*!40000 ALTER TABLE `storage` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-06-27 22:18:18
